@iamunni I have the exact same issue and I am using the exact same piece of code. What was the fix in your case ?

```
Terraform will perform the following actions:

  # openvpncloud_network.vpn_network will be created
  + resource "openvpncloud_network" "vpn_network" {
      + description     = "Managed by Terraform"
      + egress          = true
      + id              = (known after apply)
      + internet_access = "LOCAL"
      + name            = "test_network"
      + system_subnets  = (known after apply)

      + default_connector {
          + id                = (known after apply)
          + ip_v4_address     = (known after apply)
          + ip_v6_address     = (known after apply)
          + name              = "test_connector"
          + network_item_id   = (known after apply)
          + network_item_type = (known after apply)
          + vpn_region_id     = "eu-central-1"
        }

      + default_route {
          + id    = (known after apply)
          + type  = "IP_V4"
          + value = "10.1.1.0/24"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions in workspace "openvpn-cloud"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

openvpncloud_network.vpn_network: Creating...
╷
│ Error: Status code: 400, Response body: {"path":"/api/beta/networks/8b0e7bef-1af5-4f6e-b12a-837223808885/routes","requestId":"e1918ca9-328","status":400,"statusError":"Bad Request","timestamp":1677076130439}
│ 
│   with openvpncloud_network.vpn_network,
│   on openvpn.tf line 17, in resource "openvpncloud_network" "vpn_network":
│   17: resource "openvpncloud_network" "vpn_network" {
│ 
╵
```
